#pragma once
#include <vector>
#include <cstdint>

struct Sprite {
	unsigned int width;
	unsigned int height;
	std::vector<uint8_t> data; // Данные картинки (0 или 1, или цвета)
};

// 2. Создаем конкретные формы пришельцев

// Пришелец "Кальмар" (8x8 пикселей)
inline const Sprite alienSprite1 = {
	8, 8,
	{
		0,0,0,1,1,0,0,0, // ...##...
		0,0,1,1,1,1,0,0, // ..####..
		0,1,1,1,1,1,1,0, // .######.
		1,1,0,1,1,0,1,1, // ##.##.##
		1,1,1,1,1,1,1,1, // ########
		0,0,1,0,0,1,0,0, // ..#..#..
		0,1,0,1,1,0,1,0, // .#.##.#.
		1,0,1,0,0,1,0,1  // #.#..#.#
}
};

// Пришелец "Краб" (11x8)
inline const Sprite alienSprite2 = {
	11, 8,
	{
		0,0,1,0,0,0,0,0,1,0,0, // ..#.....#..
		0,0,0,1,0,0,0,1,0,0,0, // ...#...#...
		0,0,1,1,1,1,1,1,1,0,0, // ..#######..
		0,1,1,0,1,1,1,0,1,1,0, // .##.###.##.
		1,1,1,1,1,1,1,1,1,1,1, // ###########
		1,0,1,1,1,1,1,1,1,0,1, // #.#######.#
		1,0,1,0,0,0,0,0,1,0,1, // #.#.....#.#
		0,0,0,1,1,0,1,1,0,0,0  // ...##.##...
}
};